XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
/**
 * @file    UART_STM32F1xx.c
 * @author  Deadline039
 * @brief   Chip Support Package of USART on STM32F1xx
 * @version 1.0
 * @date    2024-10-22
 */

#include <CSP_Config.h>

#include "UART_STM32F1xx.h"

#include "./ring_fifo/ring_fifo.h"
#include <stdio.h>
#include <string.h>

/*****************************************************************************
 * @defgroup Private types and variables of UART.
 * @{
 */

/* The buf of `uart_pirntf` and `uart_scanf`. */
static char uart_buffer[256];

/**
 * @brief Send buf of UART.
 */
typedef struct {
    uint8_t *send_buf; /*!< Send data buf.                                  */
    uint32_t head_ptr; /*!< Pointer of send buf to control the length of DMA
                            transfer.                                       */
    size_t buf_size;   /*!< The size of buffer. Prevent overflow.           */
} uart_tx_buf_t;

/**
 * @brief Receive fifo of UART.
 */
typedef struct {
    ring_fifo_t *rx_fifo; /*!< Receive fifo.                 */
    uint8_t *rx_fifo_buf; /*!< The storage area of fifo.     */
    uint8_t *recv_buf;    /*!< Data buf of DMA to transfer.  */
    uint32_t head_ptr;    /*!< Pointer of receive buf to
                               control the DMA receive.      */
    uint32_t buf_size;    /*!< Size of `rece_buf`.           */
    uint32_t fifo_size;   /*!< Size of `rx_fifo_buf`.        */
} uart_rx_fifo_t;

/**
 * @}
 */

/*****************************************************************************
 * @defgroup Private functions.
 * @{
 */

static void uart_dmarx_halfdone_callback(UART_HandleTypeDef *huart);
static void uart_dmarx_done_callback(UART_HandleTypeDef *huart);
void uart_dmarx_idle_callback(UART_HandleTypeDef *huart);

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART1 Functions
 * @{
 */

#if USART1_ENABLE

UART_HandleTypeDef usart1_handle = {.Instance = USART1,
                                    .Init = {.WordLength = UART_WORDLENGTH_8B,
                                             .StopBits = UART_STOPBITS_1,
                                             .Parity = UART_PARITY_NONE}};

#if USART1_RX_DMA

static DMA_HandleTypeDef usart1_dmarx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART1_RX_DMA_NUMBER, USART1_RX_DMA_CHANNEL),
    .Init = {.Direction = DMA_PERIPH_TO_MEMORY,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_CIRCULAR,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART1_RX_DMA_PRIORITY)}};

static uart_rx_fifo_t usart1_rx_fifo = {.buf_size = USART1_RX_DMA_BUF_SIZE,
                                        .fifo_size = USART1_RX_DMA_FIFO_SIZE};

#endif /* USART1_RX_DMA */

#if USART1_TX_DMA

static DMA_HandleTypeDef usart1_dmatx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART1_TX_DMA_NUMBER, USART1_TX_DMA_CHANNEL),
    .Init = {.Direction = DMA_MEMORY_TO_PERIPH,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_NORMAL,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART1_TX_DMA_PRIORITY)}};

static uart_tx_buf_t usart1_tx_buf = {.buf_size = USART1_TX_DMA_BUF_SIZE};

#endif /* USART1_TX_DMA */

/**
 * @brief USART1 initialization
 *
 * @param baud_rate Baud rate.
 * @return USART1 init status.
 * @retval - 0: `UART_INIT_OK`:       Success.
 * @retval - 1: `UART_INIT_FAIL`:     UART init failed.
 * @retval - 2: `UART_INIT_DMA_FAIL`: UART DMA init failed.
 * @retval - 3: `UART_INIT_MEM_FAIL`: UART buffer memory init failed (It will
 *                                    dynamic allocate memory when using DMA).
 * @retval - 4: `UART_INITED`:        This uart is inited.
 */
uint8_t usart1_init(uint32_t baud_rate) {
    if (__HAL_RCC_USART1_IS_CLK_ENABLED()) {
        return UART_INITED;
    }

    GPIO_InitTypeDef gpio_init_struct = {.Pull = GPIO_PULLUP,
                                         .Speed = GPIO_SPEED_FREQ_HIGH};
    usart1_handle.Init.BaudRate = baud_rate;

    USART1_AFIO_REMAP();
#if USART1_TX_ENABLE
    usart1_handle.Init.Mode |= UART_MODE_TX;

    CSP_GPIO_CLK_ENABLE(USART1_TX_PORT);
    gpio_init_struct.Pin = USART1_TX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART1_TX_PORT), &gpio_init_struct);
#endif /* USART1_TX_ENABLE */

#if USART1_RX_ENABLE
    usart1_handle.Init.Mode |= UART_MODE_RX;

    CSP_GPIO_CLK_ENABLE(USART1_RX_PORT);
    gpio_init_struct.Pin = USART1_RX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART1_RX_PORT), &gpio_init_struct);
#endif /* USART1_RX_ENABLE */

#if USART1_CTS_ENABLE
    usart1_handle.Init.HwFlowCtl |= UART_HWCONTROL_CTS;

    CSP_GPIO_CLK_ENABLE(USART1_CTS_PORT);
    gpio_init_struct.Pin = USART1_CTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART1_CTS_PORT), &gpio_init_struct);
#endif /* USART1_USART1_CTS */

#if USART1_RTS_ENABLE
    usart1_handle.Init.HwFlowCtl |= UART_HWCONTROL_RTS;

    CSP_GPIO_CLK_ENABLE(USART1_RTS_PORT);
    gpio_init_struct.Pin = USART1_RTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART1_RTS_PORT), &gpio_init_struct);
#endif /* USART1_RTS_ENABLE */

    __HAL_RCC_USART1_CLK_ENABLE();

    HAL_NVIC_EnableIRQ(USART1_IRQn);
    HAL_NVIC_SetPriority(USART1_IRQn, USART1_IT_PRIORITY, USART1_IT_SUB);

#if USART1_RX_DMA
    usart1_rx_fifo.head_ptr = 0;

    usart1_rx_fifo.recv_buf = CSP_MALLOC(usart1_rx_fifo.buf_size);
    if (usart1_rx_fifo.recv_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart1_rx_fifo.rx_fifo_buf = CSP_MALLOC(usart1_rx_fifo.fifo_size);
    if (usart1_rx_fifo.rx_fifo_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart1_rx_fifo.rx_fifo = ring_fifo_init(
        usart1_rx_fifo.rx_fifo_buf, usart1_rx_fifo.fifo_size, RF_TYPE_STREAM);
    if (usart1_rx_fifo.rx_fifo == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART1_RX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart1_dmarx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart1_handle, hdmarx, usart1_dmarx_handle);

