XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART1_RX_DMA_NUMBER, USART1_RX_DMA_CHANNEL),
        USART1_RX_DMA_IT_PRIORITY, USART1_RX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART1_RX_DMA_NUMBER, USART1_RX_DMA_CHANNEL));

#endif /* USART1_RX_DMA */

#if USART1_TX_DMA
    usart1_tx_buf.send_buf = CSP_MALLOC(usart1_tx_buf.buf_size);
    if (usart1_tx_buf.send_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART1_TX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart1_dmatx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart1_handle, hdmatx, usart1_dmatx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART1_TX_DMA_NUMBER, USART1_TX_DMA_CHANNEL),
        USART1_TX_DMA_IT_PRIORITY, USART1_TX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART1_TX_DMA_NUMBER, USART1_TX_DMA_CHANNEL));
#endif /* USART1_TX_DMA */

    if (HAL_UART_Init(&usart1_handle) != HAL_OK) {
        return UART_INIT_FAIL;
    }

#if USART1_RX_DMA
    __HAL_UART_ENABLE_IT(&usart1_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart1_handle);

    HAL_UART_Receive_DMA(&usart1_handle, usart1_rx_fifo.recv_buf,
                         usart1_rx_fifo.buf_size);

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_RegisterCallback(&usart1_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart1_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USART1_RX_DMA */
    return UART_INIT_OK;
}

/**
 * @brief USART1 ISR
 *
 */
void USART1_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&usart1_handle, UART_FLAG_IDLE)) {
        __HAL_UART_CLEAR_IDLEFLAG(&usart1_handle);
        uart_dmarx_idle_callback(&usart1_handle);
    }

    HAL_UART_IRQHandler(&usart1_handle);
}

#if USART1_RX_DMA

/**
 * @brief USART1 Rx DMA ISR
 *
 */
void USART1_RX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmarx_handle);
}

#endif /* USART1_RX_DMA */

#if USART1_TX_DMA

/**
 * @brief USART1 Rx DMA ISR
 *
 */
void USART1_TX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmatx_handle);
}

#endif /* USART1_TX_DMA */

/**
 * @brief USART1 deinitialization.
 *
 * @return UART deinit status.
 * @retval - 0: `UART_DEINIT_OK`:       Success.
 * @retval - 1: `UART_DEINIT_FAIL`:     UART deinit failed.
 * @retval - 2: `UART_DEINIT_DMA_FAIL`: UART DMA deinit failed.
 * @retval - 3: `UART_NO_INIT`:         UART is not init.
 */
uint8_t usart1_deinit(void) {
    if (__HAL_RCC_USART1_IS_CLK_DISABLED()) {
        return UART_NO_INIT;
    }

    __HAL_RCC_USART1_CLK_DISABLE();

#if USART1_TX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART1_TX_PORT), USART1_TX_PIN);
#endif /* USART1_TX_ENABLE */

#if USART1_RX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART1_RX_PORT), USART1_RX_PIN);
#endif /* USART1_RX_ENABLE */

#if USART1_CTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART1_CTS_PORT), USART1_CTS_PIN);
#endif /* USART1_USART1_CTS */

#if USART1_RTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART1_RTS_PORT), USART1_RTS_PIN);
#endif /* USART1_RTS_ENABLE */
    HAL_NVIC_DisableIRQ(USART1_IRQn);

#if USART1_RX_DMA

    HAL_DMA_Abort(&usart1_dmarx_handle);
    CSP_FREE(usart1_rx_fifo.recv_buf);
    CSP_FREE(usart1_rx_fifo.rx_fifo_buf);
    ring_fifo_destroy(usart1_rx_fifo.rx_fifo);

    if (HAL_DMA_DeInit(&usart1_dmarx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART1_RX_DMA_NUMBER, USART1_RX_DMA_CHANNEL));

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_UnRegisterCallback(&usart1_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID);
    HAL_UART_UnRegisterCallback(&usart1_handle, HAL_UART_RX_COMPLETE_CB_ID);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    usart1_handle.hdmarx = NULL;

#endif /* USART1_RX_DMA */

#if USART1_TX_DMA
    HAL_DMA_Abort(&usart1_dmatx_handle);
    CSP_FREE(usart1_tx_buf.send_buf);

    if (HAL_DMA_DeInit(&usart1_dmatx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART1_TX_DMA_NUMBER, USART1_TX_DMA_CHANNEL));

    usart1_handle.hdmatx = NULL;
#endif /* USART1_TX_DMA */

    if (HAL_UART_DeInit(&usart1_handle) != HAL_OK) {
        return UART_DEINIT_FAIL;
    }

    return UART_DEINIT_OK;
}

#endif /* USART1_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART2 Functions
 * @{
 */

#if USART2_ENABLE

UART_HandleTypeDef usart2_handle = {.Instance = USART2,
                                    .Init = {.WordLength = UART_WORDLENGTH_8B,
                                             .StopBits = UART_STOPBITS_1,
                                             .Parity = UART_PARITY_NONE}};

#if USART2_RX_DMA

static DMA_HandleTypeDef usart2_dmarx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART2_RX_DMA_NUMBER, USART2_RX_DMA_CHANNEL),
    .Init = {.Direction = DMA_PERIPH_TO_MEMORY,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_CIRCULAR,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART2_RX_DMA_PRIORITY)}};

static uart_rx_fifo_t usart2_rx_fifo = {.buf_size = USART2_RX_DMA_BUF_SIZE,
                                        .fifo_size = USART2_RX_DMA_FIFO_SIZE};

#endif /* USART2_RX_DMA */

#if USART2_TX_DMA

static DMA_HandleTypeDef usart2_dmatx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART2_TX_DMA_NUMBER, USART2_TX_DMA_CHANNEL),
    .Init = {.Direction = DMA_MEMORY_TO_PERIPH,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_NORMAL,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART2_TX_DMA_PRIORITY)}};

