XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
static uart_tx_buf_t usart2_tx_buf = {.buf_size = USART2_TX_DMA_BUF_SIZE};

#endif /* USART2_TX_DMA */

/**
 * @brief USART2 initialization
 *
 * @param baud_rate Baud rate.
 * @return USART2 init status.
 * @retval - 0: `UART_INIT_OK`:       Success.
 * @retval - 1: `UART_INIT_FAIL`:     UART init failed.
 * @retval - 2: `UART_INIT_DMA_FAIL`: UART DMA init failed.
 * @retval - 3: `UART_INIT_MEM_FAIL`: UART buffer memory init failed (It will
 *                                    dynamic allocate memory when using DMA).
 * @retval - 4: `UART_INITED`:        This uart is inited.
 */
uint8_t usart2_init(uint32_t baud_rate) {
    if (__HAL_RCC_USART2_IS_CLK_ENABLED()) {
        return UART_INITED;
    }

    GPIO_InitTypeDef gpio_init_struct = {.Pull = GPIO_PULLUP,
                                         .Speed = GPIO_SPEED_FREQ_HIGH};
    usart2_handle.Init.BaudRate = baud_rate;

    USART2_AFIO_REMAP();
#if USART2_TX_ENABLE
    usart2_handle.Init.Mode |= UART_MODE_TX;

    CSP_GPIO_CLK_ENABLE(USART2_TX_PORT);
    gpio_init_struct.Pin = USART2_TX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART2_TX_PORT), &gpio_init_struct);
#endif /* USART2_TX_ENABLE */

#if USART2_RX_ENABLE
    usart2_handle.Init.Mode |= UART_MODE_RX;

    CSP_GPIO_CLK_ENABLE(USART2_RX_PORT);
    gpio_init_struct.Pin = USART2_RX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART2_RX_PORT), &gpio_init_struct);
#endif /* USART2_RX_ENABLE */

#if USART2_CTS_ENABLE
    usart2_handle.Init.HwFlowCtl |= UART_HWCONTROL_CTS;

    CSP_GPIO_CLK_ENABLE(USART2_CTS_PORT);
    gpio_init_struct.Pin = USART2_CTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART2_CTS_PORT), &gpio_init_struct);
#endif /* USART2_USART2_CTS */

#if USART2_RTS_ENABLE
    usart2_handle.Init.HwFlowCtl |= UART_HWCONTROL_RTS;

    CSP_GPIO_CLK_ENABLE(USART2_RTS_PORT);
    gpio_init_struct.Pin = USART2_RTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART2_RTS_PORT), &gpio_init_struct);
#endif /* USART2_RTS_ENABLE */

    __HAL_RCC_USART2_CLK_ENABLE();

    HAL_NVIC_EnableIRQ(USART2_IRQn);
    HAL_NVIC_SetPriority(USART2_IRQn, USART2_IT_PRIORITY, USART2_IT_SUB);

#if USART2_RX_DMA
    usart2_rx_fifo.head_ptr = 0;

    usart2_rx_fifo.recv_buf = CSP_MALLOC(usart2_rx_fifo.buf_size);
    if (usart2_rx_fifo.recv_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart2_rx_fifo.rx_fifo_buf = CSP_MALLOC(usart2_rx_fifo.fifo_size);
    if (usart2_rx_fifo.rx_fifo_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart2_rx_fifo.rx_fifo = ring_fifo_init(
        usart2_rx_fifo.rx_fifo_buf, usart2_rx_fifo.fifo_size, RF_TYPE_STREAM);
    if (usart2_rx_fifo.rx_fifo == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART2_RX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart2_dmarx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart2_handle, hdmarx, usart2_dmarx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART2_RX_DMA_NUMBER, USART2_RX_DMA_CHANNEL),
        USART2_RX_DMA_IT_PRIORITY, USART2_RX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART2_RX_DMA_NUMBER, USART2_RX_DMA_CHANNEL));

#endif /* USART2_RX_DMA */

#if USART2_TX_DMA
    usart2_tx_buf.send_buf = CSP_MALLOC(usart2_tx_buf.buf_size);
    if (usart2_tx_buf.send_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART2_TX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart2_dmatx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart2_handle, hdmatx, usart2_dmatx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART2_TX_DMA_NUMBER, USART2_TX_DMA_CHANNEL),
        USART2_TX_DMA_IT_PRIORITY, USART2_TX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART2_TX_DMA_NUMBER, USART2_TX_DMA_CHANNEL));
#endif /* USART2_TX_DMA */

    if (HAL_UART_Init(&usart2_handle) != HAL_OK) {
        return UART_INIT_FAIL;
    }

#if USART2_RX_DMA
    __HAL_UART_ENABLE_IT(&usart2_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart2_handle);

    HAL_UART_Receive_DMA(&usart2_handle, usart2_rx_fifo.recv_buf,
                         usart2_rx_fifo.buf_size);

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_RegisterCallback(&usart2_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart2_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USART2_RX_DMA */
    return UART_INIT_OK;
}

/**
 * @brief USART2 ISR
 *
 */
void USART2_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&usart2_handle, UART_FLAG_IDLE)) {
        __HAL_UART_CLEAR_IDLEFLAG(&usart2_handle);
        uart_dmarx_idle_callback(&usart2_handle);
    }

    HAL_UART_IRQHandler(&usart2_handle);
}

#if USART2_RX_DMA

/**
 * @brief USART2 Rx DMA ISR
 *
 */
void USART2_RX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmarx_handle);
}

#endif /* USART2_RX_DMA */

#if USART2_TX_DMA

/**
 * @brief USART2 Rx DMA ISR
 *
 */
void USART2_TX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmatx_handle);
}

#endif /* USART2_TX_DMA */

/**
 * @brief USART2 deinitialization.
 *
 * @return UART deinit status.
 * @retval - 0: `UART_DEINIT_OK`:       Success.
 * @retval - 1: `UART_DEINIT_FAIL`:     UART deinit failed.
 * @retval - 2: `UART_DEINIT_DMA_FAIL`: UART DMA deinit failed.
 * @retval - 3: `UART_NO_INIT`:         UART is not init.
 */
uint8_t usart2_deinit(void) {
    if (__HAL_RCC_USART2_IS_CLK_DISABLED()) {
        return UART_NO_INIT;
    }

    __HAL_RCC_USART2_CLK_DISABLE();

#if USART2_TX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART2_TX_PORT), USART2_TX_PIN);
#endif /* USART2_TX_ENABLE */

#if USART2_RX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART2_RX_PORT), USART2_RX_PIN);
#endif /* USART2_RX_ENABLE */

#if USART2_CTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART2_CTS_PORT), USART2_CTS_PIN);
#endif /* USART2_USART2_CTS */

#if USART2_RTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART2_RTS_PORT), USART2_RTS_PIN);
#endif /* USART2_RTS_ENABLE */
    HAL_NVIC_DisableIRQ(USART2_IRQn);

#if USART2_RX_DMA

    HAL_DMA_Abort(&usart2_dmarx_handle);
    CSP_FREE(usart2_rx_fifo.recv_buf);
    CSP_FREE(usart2_rx_fifo.rx_fifo_buf);
    ring_fifo_destroy(usart2_rx_fifo.rx_fifo);

    if (HAL_DMA_DeInit(&usart2_dmarx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART2_RX_DMA_NUMBER, USART2_RX_DMA_CHANNEL));

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_UnRegisterCallback(&usart2_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID);
    HAL_UART_UnRegisterCallback(&usart2_handle, HAL_UART_RX_COMPLETE_CB_ID);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    usart2_handle.hdmarx = NULL;

#endif /* USART2_RX_DMA */

#if USART2_TX_DMA
    HAL_DMA_Abort(&usart2_dmatx_handle);
    CSP_FREE(usart2_tx_buf.send_buf);

