XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
    if (HAL_DMA_DeInit(&usart2_dmatx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART2_TX_DMA_NUMBER, USART2_TX_DMA_CHANNEL));

    usart2_handle.hdmatx = NULL;
#endif /* USART2_TX_DMA */

    if (HAL_UART_DeInit(&usart2_handle) != HAL_OK) {
        return UART_DEINIT_FAIL;
    }

    return UART_DEINIT_OK;
}

#endif /* USART2_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup USART3 Functions
 * @{
 */

#if USART3_ENABLE

UART_HandleTypeDef usart3_handle = {.Instance = USART3,
                                    .Init = {.WordLength = UART_WORDLENGTH_8B,
                                             .StopBits = UART_STOPBITS_1,
                                             .Parity = UART_PARITY_NONE}};

#if USART3_RX_DMA

static DMA_HandleTypeDef usart3_dmarx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART3_RX_DMA_NUMBER, USART3_RX_DMA_CHANNEL),
    .Init = {.Direction = DMA_PERIPH_TO_MEMORY,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_CIRCULAR,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART3_RX_DMA_PRIORITY)}};

static uart_rx_fifo_t usart3_rx_fifo = {.buf_size = USART3_RX_DMA_BUF_SIZE,
                                        .fifo_size = USART3_RX_DMA_FIFO_SIZE};

#endif /* USART3_RX_DMA */

#if USART3_TX_DMA

static DMA_HandleTypeDef usart3_dmatx_handle = {
    .Instance = CSP_DMA_CHANNEL(USART3_TX_DMA_NUMBER, USART3_TX_DMA_CHANNEL),
    .Init = {.Direction = DMA_MEMORY_TO_PERIPH,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_NORMAL,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(USART3_TX_DMA_PRIORITY)}};

static uart_tx_buf_t usart3_tx_buf = {.buf_size = USART3_TX_DMA_BUF_SIZE};

#endif /* USART3_TX_DMA */

/**
 * @brief USART3 initialization
 *
 * @param baud_rate Baud rate.
 * @return USART3 init status.
 * @retval - 0: `UART_INIT_OK`:       Success.
 * @retval - 1: `UART_INIT_FAIL`:     UART init failed.
 * @retval - 2: `UART_INIT_DMA_FAIL`: UART DMA init failed.
 * @retval - 3: `UART_INIT_MEM_FAIL`: UART buffer memory init failed (It will
 *                                    dynamic allocate memory when using DMA).
 * @retval - 4: `UART_INITED`:        This uart is inited.
 */
uint8_t usart3_init(uint32_t baud_rate) {
    if (__HAL_RCC_USART3_IS_CLK_ENABLED()) {
        return UART_INITED;
    }

    GPIO_InitTypeDef gpio_init_struct = {
        .Pull = GPIO_PULLUP,
        .Speed = GPIO_SPEED_FREQ_HIGH,
    };
    usart3_handle.Init.BaudRate = baud_rate;

    USART3_AFIO_REMAP();
#if USART3_TX_ENABLE
    usart3_handle.Init.Mode |= UART_MODE_TX;

    CSP_GPIO_CLK_ENABLE(USART3_TX_PORT);
    gpio_init_struct.Pin = USART3_TX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART3_TX_PORT), &gpio_init_struct);
#endif /* USART3_TX_ENABLE */

#if USART3_RX_ENABLE
    usart3_handle.Init.Mode |= UART_MODE_RX;

    CSP_GPIO_CLK_ENABLE(USART3_RX_PORT);
    gpio_init_struct.Pin = USART3_RX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART3_RX_PORT), &gpio_init_struct);
#endif /* USART3_RX_ENABLE */

#if USART3_CTS_ENABLE
    usart3_handle.Init.HwFlowCtl |= UART_HWCONTROL_CTS;

    CSP_GPIO_CLK_ENABLE(USART3_CTS_PORT);
    gpio_init_struct.Pin = USART3_CTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART3_CTS_PORT), &gpio_init_struct);
#endif /* USART3_USART3_CTS */

#if USART3_RTS_ENABLE
    usart3_handle.Init.HwFlowCtl |= UART_HWCONTROL_RTS;

    CSP_GPIO_CLK_ENABLE(USART3_RTS_PORT);
    gpio_init_struct.Pin = USART3_RTS_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(USART3_RTS_PORT), &gpio_init_struct);
#endif /* USART3_RTS_ENABLE */

    __HAL_RCC_USART3_CLK_ENABLE();

    HAL_NVIC_EnableIRQ(USART3_IRQn);
    HAL_NVIC_SetPriority(USART3_IRQn, USART3_IT_PRIORITY, USART3_IT_SUB);

#if USART3_RX_DMA
    usart3_rx_fifo.head_ptr = 0;

    usart3_rx_fifo.recv_buf = CSP_MALLOC(usart3_rx_fifo.buf_size);
    if (usart3_rx_fifo.recv_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart3_rx_fifo.rx_fifo_buf = CSP_MALLOC(usart3_rx_fifo.fifo_size);
    if (usart3_rx_fifo.rx_fifo_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    usart3_rx_fifo.rx_fifo = ring_fifo_init(
        usart3_rx_fifo.rx_fifo_buf, usart3_rx_fifo.fifo_size, RF_TYPE_STREAM);
    if (usart3_rx_fifo.rx_fifo == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART3_RX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart3_dmarx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart3_handle, hdmarx, usart3_dmarx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART3_RX_DMA_NUMBER, USART3_RX_DMA_CHANNEL),
        USART3_RX_DMA_IT_PRIORITY, USART3_RX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART3_RX_DMA_NUMBER, USART3_RX_DMA_CHANNEL));
#endif /* USART3_RX_DMA */

#if USART3_TX_DMA
    usart3_tx_buf.send_buf = CSP_MALLOC(usart3_tx_buf.buf_size);
    if (usart3_tx_buf.send_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(USART3_TX_DMA_NUMBER);
    if (HAL_DMA_Init(&usart3_dmatx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&usart3_handle, hdmatx, usart3_dmatx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(USART3_TX_DMA_NUMBER, USART3_TX_DMA_CHANNEL),
        USART3_TX_DMA_IT_PRIORITY, USART3_TX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART3_TX_DMA_NUMBER, USART3_TX_DMA_CHANNEL));
#endif /* USART3_TX_DMA */

    if (HAL_UART_Init(&usart3_handle) != HAL_OK) {
        return UART_INIT_FAIL;
    }

#if USART3_RX_DMA
    __HAL_UART_ENABLE_IT(&usart3_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart3_handle);

    HAL_UART_Receive_DMA(&usart3_handle, usart3_rx_fifo.recv_buf,
                         usart3_rx_fifo.buf_size);

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_RegisterCallback(&usart3_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart3_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* USART3_RX_DMA */
    return UART_INIT_OK;
}

/**
 * @brief USART3 ISR
 *
 */
void USART3_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&usart3_handle, UART_FLAG_IDLE)) {
        __HAL_UART_CLEAR_IDLEFLAG(&usart3_handle);
        uart_dmarx_idle_callback(&usart3_handle);
    }

    HAL_UART_IRQHandler(&usart3_handle);
}

#if USART3_RX_DMA

/**
 * @brief USART3 Rx DMA ISR
 *
 */
void USART3_RX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmarx_handle);
}

#endif /* USART3_RX_DMA */

