XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
#if USART3_TX_DMA

/**
 * @brief USART3 Rx DMA ISR
 *
 */
void USART3_TX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmatx_handle);
}

#endif /* USART3_TX_DMA */

/**
 * @brief USART3 deinitialization.
 *
 * @return UART deinit status.
 * @retval - 0: `UART_DEINIT_OK`:       Success.
 * @retval - 1: `UART_DEINIT_FAIL`:     UART deinit failed.
 * @retval - 2: `UART_DEINIT_DMA_FAIL`: UART DMA deinit failed.
 * @retval - 3: `UART_NO_INIT`:         UART is not init.
 */
uint8_t usart3_deinit(void) {
    if (__HAL_RCC_USART3_IS_CLK_DISABLED()) {
        return UART_NO_INIT;
    }

    __HAL_RCC_USART3_CLK_DISABLE();

#if USART3_TX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART3_TX_PORT), USART3_TX_PIN);
#endif /* USART3_TX_ENABLE */

#if USART3_RX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART3_RX_PORT), USART3_RX_PIN);
#endif /* USART3_RX_ENABLE */

#if USART3_CTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART3_CTS_PORT), USART3_CTS_PIN);
#endif /* USART3_USART3_CTS */

#if USART3_RTS_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(USART3_RTS_PORT), USART3_RTS_PIN);
#endif /* USART3_RTS_ENABLE */
    HAL_NVIC_DisableIRQ(USART3_IRQn);

#if USART3_RX_DMA

    HAL_DMA_Abort(&usart3_dmarx_handle);
    CSP_FREE(usart3_rx_fifo.recv_buf);
    CSP_FREE(usart3_rx_fifo.rx_fifo_buf);
    ring_fifo_destroy(usart3_rx_fifo.rx_fifo);

    if (HAL_DMA_DeInit(&usart3_dmarx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART3_RX_DMA_NUMBER, USART3_RX_DMA_CHANNEL));

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_UnRegisterCallback(&usart3_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID);
    HAL_UART_UnRegisterCallback(&usart3_handle, HAL_UART_RX_COMPLETE_CB_ID);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    usart3_handle.hdmarx = NULL;

#endif /* USART3_RX_DMA */

#if USART3_TX_DMA
    HAL_DMA_Abort(&usart3_dmatx_handle);
    CSP_FREE(usart3_tx_buf.send_buf);

    if (HAL_DMA_DeInit(&usart3_dmatx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(USART3_TX_DMA_NUMBER, USART3_TX_DMA_CHANNEL));

    usart3_handle.hdmatx = NULL;
#endif /* USART3_TX_DMA */

    if (HAL_UART_DeInit(&usart3_handle) != HAL_OK) {
        return UART_DEINIT_FAIL;
    }

    return UART_DEINIT_OK;
}

#endif /* USART3_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART4 Functions
 * @{
 */

#if UART4_ENABLE

UART_HandleTypeDef uart4_handle = {.Instance = UART4,
                                   .Init = {.WordLength = UART_WORDLENGTH_8B,
                                            .StopBits = UART_STOPBITS_1,
                                            .Parity = UART_PARITY_NONE}};

#if UART4_RX_DMA

static DMA_HandleTypeDef uart4_dmarx_handle = {
    .Instance = CSP_DMA_CHANNEL(UART4_RX_DMA_NUMBER, UART4_RX_DMA_CHANNEL),
    .Init = {.Direction = DMA_PERIPH_TO_MEMORY,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_CIRCULAR,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(UART4_RX_DMA_PRIORITY)}};

static uart_rx_fifo_t uart4_rx_fifo = {.buf_size = UART4_RX_DMA_BUF_SIZE,
                                       .fifo_size = UART4_RX_DMA_FIFO_SIZE};

#endif /* UART4_RX_DMA */

#if UART4_TX_DMA

static DMA_HandleTypeDef uart4_dmatx_handle = {
    .Instance = CSP_DMA_CHANNEL(UART4_TX_DMA_NUMBER, UART4_TX_DMA_CHANNEL),
    .Init = {.Direction = DMA_MEMORY_TO_PERIPH,
             .MemDataAlignment = DMA_MDATAALIGN_BYTE,
             .MemInc = DMA_MINC_ENABLE,
             .Mode = DMA_NORMAL,
             .PeriphDataAlignment = DMA_PDATAALIGN_BYTE,
             .PeriphInc = DMA_PINC_DISABLE,
             .Priority = CSP_DMA_PRIORITY(UART4_TX_DMA_PRIORITY)}};

static uart_tx_buf_t uart4_tx_buf = {.buf_size = UART4_TX_DMA_BUF_SIZE};

#endif /* UART4_TX_DMA */

/**
 * @brief UART4 initialization
 *
 * @param baud_rate Baud rate.
 * @return UART4 init status.
 * @retval - 0: `UART_INIT_OK`:       Success.
 * @retval - 1: `UART_INIT_FAIL`:     UART init failed.
 * @retval - 2: `UART_INIT_DMA_FAIL`: UART DMA init failed.
 * @retval - 3: `UART_INIT_MEM_FAIL`: UART buffer memory init failed (It will
 *                                    dynamic allocate memory when using DMA).
 * @retval - 4: `UART_INITED`:        This uart is inited.
 */
uint8_t uart4_init(uint32_t baud_rate) {
    if (__HAL_RCC_UART4_IS_CLK_ENABLED()) {
        return UART_INITED;
    }

    GPIO_InitTypeDef gpio_init_struct = {.Pull = GPIO_PULLUP,
                                         .Speed = GPIO_SPEED_FREQ_HIGH};
    uart4_handle.Init.BaudRate = baud_rate;
#if UART4_TX_ENABLE
    uart4_handle.Init.Mode |= UART_MODE_TX;

    CSP_GPIO_CLK_ENABLE(UART4_TX_PORT);
    gpio_init_struct.Pin = UART4_TX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(UART4_TX_PORT), &gpio_init_struct);
#endif /* UART4_TX_ENABLE */

#if UART4_RX_ENABLE
    uart4_handle.Init.Mode |= UART_MODE_RX;

    CSP_GPIO_CLK_ENABLE(UART4_RX_PORT);
    gpio_init_struct.Pin = UART4_RX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(UART4_RX_PORT), &gpio_init_struct);
#endif /* UART4_RX_ENABLE */

    __HAL_RCC_UART4_CLK_ENABLE();

    HAL_NVIC_EnableIRQ(UART4_IRQn);
    HAL_NVIC_SetPriority(UART4_IRQn, UART4_IT_PRIORITY, UART4_IT_SUB);

#if UART4_RX_DMA
    uart4_rx_fifo.head_ptr = 0;

    uart4_rx_fifo.recv_buf = CSP_MALLOC(uart4_rx_fifo.buf_size);
    if (uart4_rx_fifo.recv_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    uart4_rx_fifo.rx_fifo_buf = CSP_MALLOC(uart4_rx_fifo.fifo_size);
    if (uart4_rx_fifo.rx_fifo_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    uart4_rx_fifo.rx_fifo = ring_fifo_init(
        uart4_rx_fifo.rx_fifo_buf, uart4_rx_fifo.fifo_size, RF_TYPE_STREAM);
    if (uart4_rx_fifo.rx_fifo == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(UART4_RX_DMA_NUMBER);
    if (HAL_DMA_Init(&uart4_dmarx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&uart4_handle, hdmarx, uart4_dmarx_handle);

