XJU-Hurricane-ShootMachine/dj2006_run_point/RemoteCtrl/Drivers/CSP/UART_STM32F1xx.c
    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(UART4_RX_DMA_NUMBER, UART4_RX_DMA_CHANNEL),
        UART4_RX_DMA_IT_PRIORITY, UART4_RX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(UART4_RX_DMA_NUMBER, UART4_RX_DMA_CHANNEL));

#endif /* UART4_RX_DMA */

#if UART4_TX_DMA
    uart4_tx_buf.send_buf = CSP_MALLOC(uart4_tx_buf.buf_size);
    if (uart4_tx_buf.send_buf == NULL) {
        return UART_INIT_MEM_FAIL;
    }

    CSP_DMA_CLK_ENABLE(UART4_TX_DMA_NUMBER);
    if (HAL_DMA_Init(&uart4_dmatx_handle) != HAL_OK) {
        return UART_INIT_DMA_FAIL;
    }

    __HAL_LINKDMA(&uart4_handle, hdmatx, uart4_dmatx_handle);

    HAL_NVIC_SetPriority(
        CSP_DMA_CHANNEL_IRQn(UART4_TX_DMA_NUMBER, UART4_TX_DMA_CHANNEL),
        UART4_TX_DMA_IT_PRIORITY, UART4_TX_DMA_IT_SUB);
    HAL_NVIC_EnableIRQ(
        CSP_DMA_CHANNEL_IRQn(UART4_TX_DMA_NUMBER, UART4_TX_DMA_CHANNEL));
#endif /* UART4_TX_DMA */

    if (HAL_UART_Init(&uart4_handle) != HAL_OK) {
        return UART_INIT_FAIL;
    }

#if UART4_RX_DMA
    __HAL_UART_ENABLE_IT(&uart4_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&uart4_handle);

    HAL_UART_Receive_DMA(&uart4_handle, uart4_rx_fifo.recv_buf,
                         uart4_rx_fifo.buf_size);

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_RegisterCallback(&uart4_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&uart4_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#endif /* UART4_RX_DMA */
    return UART_INIT_OK;
}

/**
 * @brief UART4 ISR
 *
 */
void UART4_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&uart4_handle, UART_FLAG_IDLE)) {
        __HAL_UART_CLEAR_IDLEFLAG(&uart4_handle);
        uart_dmarx_idle_callback(&uart4_handle);
    }

    HAL_UART_IRQHandler(&uart4_handle);
}

#if UART4_RX_DMA

/**
 * @brief UART4 Rx DMA ISR
 *
 */
void UART4_RX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmarx_handle);
}

#endif /* UART4_RX_DMA */

#if UART4_TX_DMA

/**
 * @brief UART4 Rx DMA ISR
 *
 */
void UART4_TX_DMA_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmatx_handle);
}

#endif /* UART4_TX_DMA */

/**
 * @brief UART4 deinitialization.
 *
 * @return UART deinit status.
 * @retval - 0: `UART_DEINIT_OK`:       Success.
 * @retval - 1: `UART_DEINIT_FAIL`:     UART deinit failed.
 * @retval - 2: `UART_DEINIT_DMA_FAIL`: UART DMA deinit failed.
 * @retval - 3: `UART_NO_INIT`:         UART is not init.
 */
uint8_t uart4_deinit(void) {
    if (__HAL_RCC_UART4_IS_CLK_DISABLED()) {
        return UART_NO_INIT;
    }

    __HAL_RCC_UART4_CLK_DISABLE();

#if UART4_TX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(UART4_TX_PORT), UART4_TX_PIN);
#endif /* UART4_TX_ENABLE */

#if UART4_RX_ENABLE
    HAL_GPIO_DeInit(CSP_GPIO_PORT(UART4_RX_PORT), UART4_RX_PIN);
#endif /* UART4_RX_ENABLE */

#if UART4_RX_DMA

    HAL_DMA_Abort(&uart4_dmarx_handle);
    CSP_FREE(uart4_rx_fifo.recv_buf);
    CSP_FREE(uart4_rx_fifo.rx_fifo_buf);
    ring_fifo_destroy(uart4_rx_fifo.rx_fifo);

    if (HAL_DMA_DeInit(&uart4_dmarx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(UART4_RX_DMA_NUMBER, UART4_RX_DMA_CHANNEL));

#if USE_HAL_UART_REGISTER_CALLBACKS
    HAL_UART_UnRegisterCallback(&uart4_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID);
    HAL_UART_UnRegisterCallback(&uart4_handle, HAL_UART_RX_COMPLETE_CB_ID);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    uart4_handle.hdmarx = NULL;

#endif /* UART4_RX_DMA */

#if UART4_TX_DMA
    HAL_DMA_Abort(&uart4_dmatx_handle);
    CSP_FREE(uart4_tx_buf.send_buf);

    if (HAL_DMA_DeInit(&uart4_dmatx_handle) != HAL_OK) {
        return UART_DEINIT_DMA_FAIL;
    }

    HAL_NVIC_DisableIRQ(
        CSP_DMA_CHANNEL_IRQn(UART4_TX_DMA_NUMBER, UART4_TX_DMA_CHANNEL));

    uart4_handle.hdmatx = NULL;
#endif /* UART4_TX_DMA */

    if (HAL_UART_DeInit(&uart4_handle) != HAL_OK) {
        return UART_DEINIT_FAIL;
    }

    return UART_DEINIT_OK;
}

#endif /* UART4_ENABLE */

/**
 * @}
 */

/*****************************************************************************
 * @defgroup UART5 Functions
 * @{
 */

#if UART5_ENABLE

UART_HandleTypeDef uart5_handle = {.Instance = UART5,
                                   .Init = {.WordLength = UART_WORDLENGTH_8B,
                                            .StopBits = UART_STOPBITS_1,
                                            .Parity = UART_PARITY_NONE}};

/**
 * @brief UART5 initialization
 *
 * @param baud_rate Baud rate.
 * @return UART5 init status.
 * @retval - 0: `UART_INIT_OK`:       Success.
 * @retval - 1: `UART_INIT_FAIL`:     UART init failed.
 * @retval - 4: `UART_INITED`:        This uart is inited.
 */
uint8_t uart5_init(uint32_t baud_rate) {
    if (__HAL_RCC_UART5_IS_CLK_ENABLED()) {
        return UART_INITED;
    }

    GPIO_InitTypeDef gpio_init_struct = {.Pull = GPIO_PULLUP,
                                         .Speed = GPIO_SPEED_FREQ_HIGH};
    uart5_handle.Init.BaudRate = baud_rate;
#if UART5_TX_ENABLE
    uart5_handle.Init.Mode |= UART_MODE_TX;

    CSP_GPIO_CLK_ENABLE(UART5_TX_PORT);
    gpio_init_struct.Pin = UART5_TX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    HAL_GPIO_Init(CSP_GPIO_PORT(UART5_TX_PORT), &gpio_init_struct);
#endif /* UART5_TX_ENABLE */

#if UART5_RX_ENABLE
    uart5_handle.Init.Mode |= UART_MODE_RX;

    CSP_GPIO_CLK_ENABLE(UART5_RX_PORT);
    gpio_init_struct.Pin = UART5_RX_PIN;
    gpio_init_struct.Mode = GPIO_MODE_AF_INPUT;
    HAL_GPIO_Init(CSP_GPIO_PORT(UART5_RX_PORT), &gpio_init_struct);
#endif /* UART5_RX_ENABLE */

    __HAL_RCC_UART5_CLK_ENABLE();

    HAL_NVIC_EnableIRQ(UART5_IRQn);
    HAL_NVIC_SetPriority(UART5_IRQn, UART5_IT_PRIORITY, UART5_IT_SUB);

    if (HAL_UART_Init(&uart5_handle) != HAL_OK) {
        return UART_INIT_FAIL;
    }

    return UART_INIT_OK;
}

/**
 * @brief UART5 ISR
 *
 */
void UART5_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&uart5_handle, UART_FLAG_IDLE)) {
        __HAL_UART_CLEAR_IDLEFLAG(&uart5_handle);
        uart_dmarx_idle_callback(&uart5_handle);
    }

    HAL_UART_IRQHandler(&uart5_handle);
}

/**
 * @brief UART5 deinitialization.
 *
 * @return UART deinit status.
 * @retval - 0: `UART_DEINIT_OK`:       Success.
 * @retval - 1: `UART_DEINIT_FAIL`:     UART deinit failed.
 * @retval - 2: `UART_DEINIT_DMA_FAIL`: UART DMA deinit failed.
 * @retval - 3: `UART_NO_INIT`:         UART is not init.
 */
uint8_t uart5_deinit(void) {
    if (__HAL_RCC_UART5_IS_CLK_DISABLED()) {
        return UART_NO_INIT;
    }

    __HAL_RCC_UART5_CLK_DISABLE();

